tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/constant/energySourceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      energySourcesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
    source1
    {
        active          true;
        timeStart       0.15;
        duration        0.1;
        selectionMode   cellSet;
        volumeMode      absolute;
        fieldData       10000;
        cellSet         ignitionCells;
    }
);

// ************************************************************************* //
