tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/system/cellSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      cellSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

name ignitionCells;

action new;

topoSetSources
(
    sphereToCell
    {
        centre          ( 0.125 0.375 0.05 );
        radius          0.005;
    }
);

// ************************************************************************* //
